Autodesk.Revit.DB.LabelUtils.GetLabelForSymbol(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a symbol.
Remarks:
The name is obtained in the current Revit language.
symbolTypeId:
Identifier of the symbol to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Symbol must have a definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.LabelUtils.GetLabelFor(Autodesk.Revit.DB.UnitSymbolType)
Gets the user-visible name for a UnitSymbolType.
Remarks:
The name is obtained in the current Revit language.
unitSymbolType:
The UnitSymbolType to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Symbol must have a definition. UST_NONE and UST_CUSTOM are not allowed.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014

Autodesk.Revit.DB.LabelUtils.GetLabelForSpec(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a spec.
Remarks:
The name is obtained in the current Revit language.
specTypeId:
Identifier of the spec to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot find info for the spec.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.LabelUtils.GetLabelForUnit(Autodesk.Revit.DB.ForgeTypeId)
Gets the user-visible name for a unit.
Remarks:
The name is obtained in the current Revit language.
unitTypeId:
Identifier of the unit to get the user-visible name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Cannot find DisplayUnitTypeInfo for the given unit identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011